Repository: giellalt/corpus-smj
Catalog: tmx/eng/facta/arran.no/apningstider.107275.no.html.tmx
Source language: smj
Languages: eng

source: Åpningstider - Árran - julevsáme guovdásj / lulesamisk senter
eng: Åpningstider - Rabásájge - Opening hours

source: Utstillinger:
eng: Exhibitions:

source: Viessom: Sáme sijdda ja merrasáme kultuvrra
eng: Viessom: The Sami farm and coastal Sami culture

source: Samisk iesjdåbddo ja kultuvrra
eng: Sami identity and culture

source: Sáme bivtasdábe, silba ja goabdes
eng: Sami costume tradition, silver and drumBilletter:

source: Máná vuollela 6 jage: navku
eng: Children under 6 years: free

source: Máná 6-18 jagága: 25 kr
eng: Children 6-18 years: 25 nok

source: Juohkusa ienep10 ulmutja: 50 krTickets:
eng: Group of 10 persons: 50 nok
